SECOND-WDI-PROJECT/app/views/places/index.html.erb

SELECT "pics".* FROM "pics" WHERE "pics"."place_id" = ?  [["place_id", 8]]
---
    <div class="panel-body">
      <% place.pics.each do |pic| %>