SECOND-WDI-PROJECT/app/views/places/show.html.erb

    <strong></strong>
    <% @place.pics.each do |pic| %>
---
SELECT "pics".* FROM "pics" WHERE "pics"."place_id" = ?  [["place_id", 10]]

    <strong></strong>
    <% @place.comment_threads.each do |ct| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."place_id" = ?  [[nil, 10]]