SECOND-WDI-PROJECT/app/controllers/pics_controller.rb

  def index
    @q = Pic.ransack(params[:q])
    if params[:q].present?
      @q = Pic.ransack(params[:q])
      @pics = @q.result(distinct: true)
    else
      @pics = Pic.all
---
SELECT DISTINCT "pics".* FROM "pics"

  def show
    @pic = Pic.find(params[:id])
---
SELECT  "pics".* FROM "pics" WHERE "pics"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @pic = current_user.pics.new(pic_params)

    # if @pic.save
    #      redirect_to pics_path, notice: "The pic has been uploaded."
    #    else
    #      render "new"
    #    end
    respond_to do |format|
      if @pic.save
---
INSERT INTO "pics" ("url", "title", "description", "place_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["url", ""], ["title", ""], ["description", ""], ["place_id", 9], ["user_id", 2], ["created_at", "2015-11-01 19:00:23.254560"], ["updated_at", "2015-11-01 19:00:23.254560"]]

  def update
    respond_to do |format|
      if @pic.update(pic_params)
---
UPDATE "pics" SET "url" = ?, "image" = ?, "description" = ?, "place_id" = ?, "updated_at" = ? WHERE "pics"."id" = ?  [["url", ""], ["image", "LateSAil_Bahamas3.jpg"], ["description", ""], ["place_id", 47], ["updated_at", "2015-11-03 11:50:14.443302"], ["id", 25]]

  def destroy
    current_user.pics.find(params[:id]).destroy
---
DELETE FROM "pics" WHERE "pics"."id" = ?  [["id", 8]]
SELECT  "pics".* FROM "pics" WHERE "pics"."user_id" = ? AND "pics"."id" = ? LIMIT 1  [["user_id", 2], ["id", 8]]

  def upvote
    @pic = Pic.find(params[:id])
---
SELECT  "pics".* FROM "pics" WHERE "pics"."id" = ? LIMIT 1  [["id", 1]]

    def set_pic
      @pic = Pic.find(params[:id])
---
SELECT  "pics".* FROM "pics" WHERE "pics"."id" = ? LIMIT 1  [["id", 1]]