SECOND-WDI-PROJECT/app/controllers/places_controller.rb

  def index
     @q = Place.ransack(params[:q])
     if params[:q].present?
       @q = Place.ransack(params[:q])
       @places = @q.result(distinct: true)
     else
       @places = Place.all
---
SELECT DISTINCT "places".* FROM "places"

  def create
    @place = Place.new(place_params)

    respond_to do |format|
      if @place.save
---
INSERT INTO "places" ("country", "place", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["country", "Maldives"], ["place", "Male"], ["created_at", "2015-11-01 17:09:44.311665"], ["updated_at", "2015-11-01 17:09:44.311665"]]

  def update
    respond_to do |format|
      if @place.update(place_params)
---
UPDATE "places" SET "country" = ?, "place" = ?, "updated_at" = ? WHERE "places"."id" = ?  [["country", ""], ["place", ""], ["updated_at", "2015-11-01 17:13:26.514083"], ["id", 1]]

  def upvote
    @place = Place.find(params[:id])
---
SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT 1  [["id", 8]]

  def random_place
    @places = Place.all #ONLY REFERS TO PLACES THAT EXIST AS LOOKS IN DATABASE NOT URLS ETC
---
SELECT "places".* FROM "places"