SECOND-WDI-PROJECT/app/views/pics/_form.html.erb

    <%= f.label :place %><br>
    <%=  f.collection_select(:place_id, Place.all, :id, :place )%>
---
SELECT "places".* FROM "places"